[{"id": "1", "name": "Bulbasaur", "image": "p1", "type1": "Grass", "height": "0.7 m", "weight": "6.9 kg", "desc": "Bulbasaur can be seen napping in bright sunlight. There is a seed on its back. By soaking up the sun’s rays, the seed grows progressively larger.", "type2": "Poison"}, {"id": "2", "name": "Ivysaur", "image": "p2", "type1": "Grass", "height": "1 m", "weight": "13 kg", "desc": "There is a bud on this Pokémon’s back. To support its weight, Ivysaur’s legs and trunk grow thick and strong. If it starts spending more time lying in the sunlight, it’s a sign that the bud will bloom into a large flower soon.", "type2": "Poison"}, {"id": "3", "name": "Venusaur", "image": "p3", "type1": "Grass", "height": "2 m", "weight": "100 kg", "desc": "There is a large flower on Venusaur’s back. The flower is said to take on vivid colors if it gets plenty of nutrition and sunlight. The flower’s aroma soothes the emotions of people.", "type2": "Poison"}, {"id": "4", "name": "Charmander", "image": "p4", "type1": "Fire", "height": "0.6 m", "weight": "8.5 kg", "desc": "The flame that burns at the tip of its tail is an indication of its emotions. The flame wavers when Charmander is enjoying itself. If the Pokémon becomes enraged, the flame burns fiercely."}, {"id": "5", "name": "Charmeleon", "image": "p5", "type1": "Fire", "height": "1.1 m", "weight": "19 kg", "desc": "Charmeleon mercilessly destroys its foes using its sharp claws. If it encounters a strong foe, it turns aggressive. In this excited state, the flame at the tip of its tail flares with a bluish white color."}, {"id": "6", "name": "Charizard", "image": "p6", "type1": "Fire", "height": "1.7 m", "weight": "90.5 kg", "desc": "Charizard flies around the sky in search of powerful opponents. It breathes fire of such great heat that it melts anything. However, it never turns its fiery breath on any opponent weaker than itself.", "type2": "Flying"}, {"id": "7", "name": "Squirtle", "image": "p7", "type1": "Water", "height": "0.5 m", "weight": "9 kg", "desc": "Squirtle’s shell is not merely used for protection. The shell’s rounded shape and the grooves on its surface help minimize resistance in water, enabling this Pokémon to swim at high speeds."}, {"id": "8", "name": "Wartortle", "image": "p8", "type1": "Water", "height": "1 m", "weight": "22.5 kg", "desc": "Its tail is large and covered with a rich, thick fur. The tail becomes increasingly deeper in color as Wartortle ages. The scratches on its shell are evidence of this Pokémon’s toughness as a battler."}, {"id": "9", "name": "Blastoise", "image": "p9", "type1": "Water", "height": "1.6 m", "weight": "85.5 kg", "desc": "Blastoise has water spouts that protrude from its shell. The water spouts are very accurate. They can shoot bullets of water with enough accuracy to strike empty cans from a distance of over 160 feet."}, {"id": "10", "name": "Caterpie", "image": "p10", "type1": "Bug", "height": "0.3 m", "weight": "2.9 kg", "desc": "Its body is soft and weak. In nature, its perpetual fate is to be seen by others as food."}, {"id": "11", "name": "Metapod", "image": "p11", "type1": "Bug", "height": "0.7 m", "weight": "9.9 kg", "desc": "Its hard shell doesn’t crack a bit even if Pikipek pecks at it, but it will tip over, spilling out its insides."}, {"id": "12", "name": "Butterfree", "image": "p12", "type1": "Bug", "height": "1.1 m", "weight": "32 kg", "desc": "Nectar from pretty flowers is its favorite food. In fields of flowers, it has heated battles with Cutiefly for territory.", "type2": "Flying"}, {"id": "13", "name": "Weedle", "image": "p13", "type1": "Bug", "height": "0.3 m", "weight": "3.2 kg", "desc": "Weedle has an extremely acute sense of smell. It is capable of distinguishing its favorite kinds of leaves from those it dislikes just by sniffing with its big red proboscis (nose).", "type2": "Poison"}, {"id": "14", "name": "Kakuna", "image": "p14", "type1": "Bug", "height": "0.6 m", "weight": "10 kg", "desc": "Kakuna remains virtually immobile as it clings to a tree. However, on the inside, it is extremely busy as it prepares for its coming evolution. This is evident from how hot the shell becomes to the touch.", "type2": "Poison"}, {"id": "15", "name": "Beedrill", "image": "p15", "type1": "Bug", "height": "1 m", "weight": "29.5 kg", "desc": "Beedrill is extremely territorial. No one should ever approach its nest—this is for their own safety. If angered, they will attack in a furious swarm.", "type2": "Poison"}, {"id": "16", "name": "Pidgey", "image": "p16", "type1": "Normal", "height": "0.3 m", "weight": "1.8 kg", "desc": "Pidgey has an extremely sharp sense of direction. It is capable of unerringly returning home to its nest, however far it may be removed from its familiar surroundings.", "type2": "Flying"}, {"id": "17", "name": "Pidgeotto", "image": "p17", "type1": "Normal", "height": "1.1 m", "weight": "30 kg", "desc": "Pidgeotto claims a large area as its own territory. This Pokémon flies around, patrolling its living space. If its territory is violated, it shows no mercy in thoroughly punishing the foe with its sharp claws.", "type2": "Flying"}, {"id": "18", "name": "Pidgeot", "image": "p18", "type1": "Normal", "height": "1.5 m", "weight": "39.5 kg", "desc": "This Pokémon has a dazzling plumage of beautifully glossy feathers. Many Trainers are captivated by the striking beauty of the feathers on its head, compelling them to choose Pidgeot as their Pokémon.", "type2": "Flying"}, {"id": "19", "name": "Rattata", "image": "p19", "type1": "Normal", "height": "0.3 m", "weight": "3.5 kg", "desc": "This Pokémon is common but hazardous. Its sharp incisors can easily cut right through hard wood."}, {"id": "20", "name": "Raticate", "image": "p20", "type1": "Normal", "height": "0.7 m", "weight": "18.5 kg", "desc": "Its whiskers are essential for maintaining its balance. No matter how friendly you are, it will get angry and bite you if you touch its whiskers."}, {"id": "21", "name": "Spearow", "image": "p21", "type1": "Normal", "height": "0.3 m", "weight": "2 kg", "desc": "Due to its short wings, it can’t fly long distances. It wanders about restlessly and pecks at bug Pokémon.", "type2": "Flying"}, {"id": "22", "name": "Fearow", "image": "p22", "type1": "Normal", "height": "1.2 m", "weight": "38 kg", "desc": "In Alola, fish Pokémon are its prey. It can be seen circling above the ocean searching for food.", "type2": "Flying"}, {"id": "23", "name": "Ekans", "image": "p23", "type1": "Poison", "height": "2 m", "weight": "6.9 kg", "desc": "The eggs of bird Pokémon are its favorite food. It swallows eggs whole, so sometimes an egg gets stuck, and Ekans faints."}, {"id": "24", "name": "Arbok", "image": "p24", "type1": "Poison", "height": "3.5 m", "weight": "65 kg", "desc": "After stunning its opponents with the pattern on its stomach, it quickly wraps them up in its body and waits for them to stop moving."}, {"id": "25", "name": "Pikachu", "image": "p25", "type1": "Electric", "height": "0.4 m", "weight": "6 kg", "desc": "While sleeping, it generates electricity in the sacs in its cheeks. If it’s not getting enough sleep, it will be able to use only weak electricity."}, {"id": "26", "name": "Raichu", "image": "p26", "type1": "Electric", "height": "0.8 m", "weight": "30 kg", "desc": "Because so many Trainers like the way Pikachu looks, you don’t see this Pokémon very often."}, {"id": "27", "name": "Sandshrew", "image": "p27", "type1": "Ground", "height": "0.6 m", "weight": "12 kg", "desc": "When its skin gets wrinkled from moisture, it heads for a volcano. It lies flat on a spot with a lot of geothermal heat and dries itself out."}, {"id": "28", "name": "Sandslash", "image": "p28", "type1": "Ground", "height": "1 m", "weight": "29.5 kg", "desc": "Thanks to its thick claws, it’s good at climbing trees. There are plenty of Sandslash that park themselves in trees and go right to sleep."}, {"id": "29", "name": "Nidoran♀", "image": "p29", "type1": "Poison", "height": "0.4 m", "weight": "7 kg", "desc": "Nidoran♀ has barbs that secrete a powerful poison. They are thought to have developed as protection for this small-bodied Pokémon. When enraged, it releases a horrible toxin from its horn."}, {"id": "30", "name": "Nidorina", "image": "p30", "type1": "Poison", "height": "0.8 m", "weight": "20 kg", "desc": "When Nidorina are with their friends or family, they keep their barbs tucked away to prevent hurting each other. This Pokémon appears to become nervous if separated from the others."}, {"id": "31", "name": "Nidoqueen", "image": "p31", "type1": "Poison", "height": "1.3 m", "weight": "60 kg", "desc": "Nidoqueen’s body is encased in extremely hard scales. It is adept at sending foes flying with harsh tackles. This Pokémon is at its strongest when it is defending its young.", "type2": "Ground"}, {"id": "32", "name": "Nidoran♂", "image": "p32", "type1": "Poison", "height": "0.5 m", "weight": "9 kg", "desc": "Nidoran♂ has developed muscles for moving its ears. Thanks to them, the ears can be freely moved in any direction. Even the slightest sound does not escape this Pokémon’s notice."}, {"id": "33", "name": "Nidorino", "image": "p33", "type1": "Poison", "height": "0.9 m", "weight": "19.5 kg", "desc": "Nidorino has a horn that is harder than a diamond. If it senses a hostile presence, all the barbs on its back bristle up at once, and it challenges the foe with all its might."}, {"id": "34", "name": "Nidoking", "image": "p34", "type1": "Poison", "height": "1.4 m", "weight": "62 kg", "desc": "Nidoking’s thick tail packs enormously destructive power. With one swing, it can topple a metal transmission tower. Once this Pokémon goes on a rampage, there is no stopping it.", "type2": "Ground"}, {"id": "35", "name": "Clefairy", "image": "p35", "type1": "Fairy", "height": "0.6 m", "weight": "7.5 kg", "desc": "Bathed in moonlight, its wings glow faintly. Without even flapping, Clefairy rises into the air, where it dances around."}, {"id": "36", "name": "Clefable", "image": "p36", "type1": "Fairy", "height": "1.3 m", "weight": "40 kg", "desc": "Some scientists believe that it gazes intently at the sky on nights with a full moon because it’s homesick."}, {"id": "37", "name": "Vulpix", "image": "p37", "type1": "Fire", "height": "0.6 m", "weight": "9.9 kg", "desc": "It manipulates balls of fire to catch its prey. If you raise one from when it’s young, it will grow close to you like a puppy Pokémon."}, {"id": "38", "name": "Ninetales", "image": "p38", "type1": "Fire", "height": "1.1 m", "weight": "19.9 kg", "desc": "The flickering flames it spews from its mouth leave its opponents hypnotized. Then, this extremely intelligent Pokémon attacks."}, {"id": "39", "name": "Jigglypuff", "image": "p39", "type1": "Normal", "height": "0.5 m", "weight": "5.5 kg", "desc": "The songs they sing are totally different depending on the region they live in. Some even sound like they’re shouting!", "type2": "Fairy"}, {"id": "40", "name": "Wigglytuff", "image": "p40", "type1": "Normal", "height": "1 m", "weight": "12 kg", "desc": "When it gets angry, it inhales with all its might, and its body gradually inflates. Sometimes they can grow 20 times larger!", "type2": "Fairy"}, {"id": "41", "name": "Zubat", "image": "p41", "type1": "Poison", "height": "0.8 m", "weight": "7.5 kg", "desc": "Their skin is so thin that they’ll be burned if sunlight hits them. When it gets cold out, they gather together to warm one another’s bodies.", "type2": "Flying"}, {"id": "42", "name": "Golbat", "image": "p42", "type1": "Poison", "height": "1.6 m", "weight": "55 kg", "desc": "They can suck down over 10 ounces of blood in one go. They have been known to drink so much blood that they can no longer fly.", "type2": "Flying"}, {"id": "43", "name": "Oddish", "image": "p43", "type1": "Grass", "height": "0.5 m", "weight": "5.4 kg", "desc": "Oddish searches for fertile, nutrient-rich soil, then plants itself. During the daytime, while it is planted, this Pokémon’s feet are thought to change shape and become similar to the roots of trees.", "type2": "Poison"}, {"id": "44", "name": "Gloom", "image": "p44", "type1": "Grass", "height": "0.8 m", "weight": "8.6 kg", "desc": "From its mouth Gloom drips honey that smells absolutely horrible. Apparently, it loves the horrid stench. It sniffs the noxious fumes and then drools even more of its honey.", "type2": "Poison"}, {"id": "45", "name": "Vileplume", "image": "p45", "type1": "Grass", "height": "1.2 m", "weight": "18.6 kg", "desc": "Vileplume has the world’s largest petals. They are used to attract prey that are then doused with toxic spores. Once the prey are immobilized, this Pokémon catches and devours them.", "type2": "Poison"}, {"id": "46", "name": "Paras", "image": "p46", "type1": "Bug", "height": "0.3 m", "weight": "5.4 kg", "desc": "The mushrooms, known as tochukaso, are controlling the bug. Even if the bug bugs the mushrooms, they tell it to bug off.", "type2": "Grass"}, {"id": "47", "name": "Parasect", "image": "p47", "type1": "Bug", "height": "1 m", "weight": "29.5 kg", "desc": "Its poisonous spores are also used in traditional medicine. Apparently, spores produced in Alola are not of very good quality.", "type2": "Grass"}, {"id": "48", "name": "Venonat", "image": "p48", "type1": "Bug", "height": "1 m", "weight": "30 kg", "desc": "Venonat is said to have evolved with a coat of thin, stiff hair that covers its entire body for protection. It possesses large eyes that never fail to spot even minuscule prey.", "type2": "Poison"}, {"id": "49", "name": "Venomoth", "image": "p49", "type1": "Bug", "height": "1.5 m", "weight": "12.5 kg", "desc": "Venomoth is nocturnal—it is a Pokémon that only becomes active at night. Its favorite prey are small insects that gather around streetlights, attracted by the light in the darkness.", "type2": "Poison"}, {"id": "50", "name": "Diglett", "image": "p50", "type1": "Ground", "height": "0.2 m", "weight": "0.8 kg", "desc": "Around their crops, farmers plant the kind of tree that Diglett like to eat as a way of getting Diglett to plow the fields for them."}, {"id": "51", "name": "Dugtrio", "image": "p51", "type1": "Ground", "height": "0.7 m", "weight": "33.3 kg", "desc": "Dugtrio’s heads are sleek and smooth and incredibly hard. It can dig through any soil with its headbutts."}, {"id": "52", "name": "Meowth", "image": "p52", "type1": "Normal", "height": "0.4 m", "weight": "4.2 kg", "desc": "It loves coins, so if you give it one, you can make friends with Meowth easily. But it’s fickle, so you can’t count on that friendship lasting."}, {"id": "53", "name": "Persian", "image": "p53", "type1": "Normal", "height": "1 m", "weight": "32 kg", "desc": "This Pokémon is popular with rich people. It’s also targeted by hunters who are after the jewel in its forehead."}, {"id": "54", "name": "Psyduck", "image": "p54", "type1": "Water", "height": "0.8 m", "weight": "19.6 kg", "desc": "It has been found that its brain cells are 10 times more active when Psyduck is experiencing a headache."}, {"id": "55", "name": "Golduck", "image": "p55", "type1": "Water", "height": "1.7 m", "weight": "76.6 kg", "desc": "A professional swimmer, it can continue swimming for two days straight by waving its long tail skillfully."}, {"id": "56", "name": "Mankey", "image": "p56", "type1": "Fighting", "height": "0.5 m", "weight": "28 kg", "desc": "If one gets angry, all the others around it will get angry, so silence is a rare visitor in a troop of Mankey."}, {"id": "57", "name": "Primeape", "image": "p57", "type1": "Fighting", "height": "1 m", "weight": "32 kg", "desc": "The blood vessels in its brain are sturdier than those of other Pokémon, so it can stay healthy despite its constant raging."}, {"id": "58", "name": "Growlithe", "image": "p58", "type1": "Fire", "height": "0.7 m", "weight": "19 kg", "desc": "It has lived alongside humans since ages ago. Its bones have been found in excavations of ruins from the Stone Age."}, {"id": "59", "name": "Arcanine", "image": "p59", "type1": "Fire", "height": "1.9 m", "weight": "155 kg", "desc": "There are so many old tales about them that they’re called legendary Pokémon, but there are way more of them around than you’d expect."}, {"id": "60", "name": "Poliwag", "image": "p60", "type1": "Water", "height": "0.6 m", "weight": "12.4 kg", "desc": "The direction of the swirl on their stomachs differs depending on where they live. Poliwag aficionados can tell them apart at a glance."}, {"id": "61", "name": "Poliwhirl", "image": "p61", "type1": "Water", "height": "1 m", "weight": "20 kg", "desc": "Its health suffers when its skin dries out, so be sure to moisturize it diligently."}, {"id": "62", "name": "Poliwrath", "image": "p62", "type1": "Water", "height": "1.3 m", "weight": "54 kg", "desc": "The muscles it has developed through swimming are thick and powerful. When it lands a square punch, it can turn huge boulders to dust.", "type2": "Fighting"}, {"id": "63", "name": "Abra", "image": "p63", "type1": "Psychic", "height": "0.9 m", "weight": "19.5 kg", "desc": "It can read others’ minds and will teleport away when danger approaches. You must clear your mind if you want to catch it."}, {"id": "64", "name": "Kadabra", "image": "p64", "type1": "Psychic", "height": "1.3 m", "weight": "56.5 kg", "desc": "It possesses strong mental capabilities, but its psychic powers are halved when it’s not holding a silver spoon."}, {"id": "65", "name": "Alakazam", "image": "p65", "type1": "Psychic", "height": "1.5 m", "weight": "48 kg", "desc": "If it trusts someone deeply, it will let them have one of its spoons. Anything you eat with that spoon is apparently delicious."}, {"id": "66", "name": "Machop", "image": "p66", "type1": "Fighting", "height": "0.8 m", "weight": "19.5 kg", "desc": "It likes food that’s highly nutritious because its instincts drive it to build muscle efficiently."}, {"id": "67", "name": "Machoke", "image": "p67", "type1": "Fighting", "height": "1.5 m", "weight": "70.5 kg", "desc": "A popular motif for sculptures, its incredibly well-developed muscles have captured the imagination of many an artist."}, {"id": "68", "name": "Machamp", "image": "p68", "type1": "Fighting", "height": "1.6 m", "weight": "130 kg", "desc": "With four arms, it can attack and defend simultaneously. It’s said to have mastered every martial art in the world."}, {"id": "69", "name": "Bellsprout", "image": "p69", "type1": "Grass", "height": "0.7 m", "weight": "4 kg", "desc": "Bellsprout’s thin and flexible body lets it bend and sway to avoid any attack, however strong it may be. From its mouth, this Pokémon spits a corrosive fluid that melts even iron.", "type2": "Poison"}, {"id": "70", "name": "Weepinbell", "image": "p70", "type1": "Grass", "height": "1 m", "weight": "6.4 kg", "desc": "Weepinbell has a large hook on its rear end. At night, the Pokémon hooks on to a tree branch and goes to sleep. If it moves around in its sleep, it may wake up to find itself on the ground.", "type2": "Poison"}, {"id": "71", "name": "Victreebel", "image": "p71", "type1": "Grass", "height": "1.7 m", "weight": "15.5 kg", "desc": "Victreebel has a long vine that extends from its head. This vine is waved and flicked about as if it were an animal to attract prey. When an unsuspecting prey draws near, this Pokémon swallows it whole.", "type2": "Poison"}, {"id": "72", "name": "Tentacool", "image": "p72", "type1": "Water", "height": "0.9 m", "weight": "45.5 kg", "desc": "Its body is 99% water. The remaining 1% contains the organ that makes its poison.", "type2": "Poison"}, {"id": "73", "name": "Tentacruel", "image": "p73", "type1": "Water", "height": "1.6 m", "weight": "55 kg", "desc": "It communicates with others of its kind by lighting up the red orbs on its head. When the orbs are blinking, it’s a warning sign.", "type2": "Poison"}, {"id": "74", "name": "Geodude", "image": "p74", "type1": "Rock", "height": "0.4 m", "weight": "20 kg", "desc": "It uses both hands to climb precipitous cliffs. People who see it in action have been known to take up bouldering.", "type2": "Ground"}, {"id": "75", "name": "Graveler", "image": "p75", "type1": "Rock", "height": "1 m", "weight": "105 kg", "desc": "It travels by rolling down cliffs. If it falls into a river, it will explode with its last gasp.", "type2": "Ground"}, {"id": "76", "name": "Golem", "image": "p76", "type1": "Rock", "height": "1.4 m", "weight": "300 kg", "desc": "It detonates its own body. The power from that explosion can propel it up steep mountain paths with amazing speed.", "type2": "Ground"}, {"id": "77", "name": "Ponyta", "image": "p77", "type1": "Fire", "height": "1 m", "weight": "30 kg", "desc": "Ponyta is very weak at birth. It can barely stand up. This Pokémon becomes stronger by stumbling and falling to keep up with its parent."}, {"id": "78", "name": "Rapidash", "image": "p78", "type1": "Fire", "height": "1.7 m", "weight": "95 kg", "desc": "Rapidash usually can be seen casually cantering in the fields and plains. However, when this Pokémon turns serious, its fiery manes flare and blaze as it gallops its way up to 150 mph."}, {"id": "79", "name": "Slowpoke", "image": "p79", "type1": "Water", "height": "1.2 m", "weight": "36 kg", "desc": "Although their tails, which fall off naturally, can easily be found lying around, they’re a precious ingredient for cooking.", "type2": "Psychic"}, {"id": "80", "name": "Slowbro", "image": "p80", "type1": "Water", "height": "1.6 m", "weight": "78.5 kg", "desc": "Shellder, in its greed to suck out more and more sweetness from Slowbro’s tail, has metamorphosed into a spiral-shaped shell.", "type2": "Psychic"}, {"id": "81", "name": "Magnemite", "image": "p81", "type1": "Electric", "height": "0.3 m", "weight": "6 kg", "desc": "Perhaps because electrical lines are often buried these days, the number of Magnemite attacks on power plants has increased.", "type2": "Steel"}, {"id": "82", "name": "Magneton", "image": "p82", "type1": "Electric", "height": "1 m", "weight": "60 kg", "desc": "When rain clouds form, many Magneton gather in high places to wait for lightning to strike.", "type2": "Steel"}, {"id": "83", "name": "Farfetch'd", "image": "p83", "type1": "Normal", "height": "0.8 m", "weight": "15 kg", "desc": "Farfetch’d is always seen with a stalk from a plant of some sort. Apparently, there are good stalks and bad stalks. This Pokémon has been known to fight with others over stalks.", "type2": "Flying"}, {"id": "84", "name": "Doduo", "image": "p84", "type1": "Normal", "height": "1.4 m", "weight": "39.2 kg", "desc": "Doduo’s two heads contain completely identical brains. A scientific study reported that on rare occasions, there will be examples of this Pokémon possessing different sets of brains.", "type2": "Flying"}, {"id": "85", "name": "Dodrio", "image": "p85", "type1": "Normal", "height": "1.8 m", "weight": "85.2 kg", "desc": "Apparently, the heads aren’t the only parts of the body that Dodrio has three of. It has three sets of hearts and lungs as well, so it is capable of running long distances without rest.", "type2": "Flying"}, {"id": "86", "name": "Seel", "image": "p86", "type1": "Water", "height": "1.1 m", "weight": "90 kg", "desc": "Thanks to its thick fat, cold seas don’t bother it at all, but it gets tired pretty easily in warm waters."}, {"id": "87", "name": "Dewgong", "image": "p87", "type1": "Water", "height": "1.7 m", "weight": "120 kg", "desc": "It sunbathes on the beach after meals. The rise in its body temperature helps its digestion.", "type2": "Ice"}, {"id": "88", "name": "Grimer", "image": "p88", "type1": "Poison", "height": "0.9 m", "weight": "30 kg", "desc": "The wastewater coming from factories is clean these days, so Grimer have nothing to eat. They’re said to be on the verge of extinction."}, {"id": "89", "name": "Muk", "image": "p89", "type1": "Poison", "height": "1.2 m", "weight": "30 kg", "desc": "Because they scatter germs everywhere, they’ve long been targeted for extermination, leading to a steep decline in their population."}, {"id": "90", "name": "Shellder", "image": "p90", "type1": "Water", "height": "0.3 m", "weight": "4 kg", "desc": "Even when its shell is closed, its tongue still hangs out. If you give its tongue a good yank, the shock will cause Shellder to open its shell."}, {"id": "91", "name": "Cloyster", "image": "p91", "type1": "Water", "height": "1.5 m", "weight": "132.5 kg", "desc": "Slowpoke tails are its favorite food. It has even been known to come up on land to look for Slowpoke from time to time.", "type2": "Ice"}, {"id": "92", "name": "Gastly", "image": "p92", "type1": "Ghost", "height": "1.3 m", "weight": "0.1 kg", "desc": "Poisonous gas comprises 95% of its body. It’s said that the remaining 5% is made up of the souls of those who died from the gas.", "type2": "Poison"}, {"id": "93", "name": "Haunter", "image": "p93", "type1": "Ghost", "height": "1.6 m", "weight": "0.1 kg", "desc": "It’s dangerous to go outside alone on nights when you’re feeling sad. Haunter will catch you, and you won’t be able to go back home.", "type2": "Poison"}, {"id": "94", "name": "Gengar", "image": "p94", "type1": "Ghost", "height": "1.5 m", "weight": "40.5 kg", "desc": "Even your home isn’t safe. Gengar will lurk in whatever dark corner of a room it can find and wait for its chance to catch its prey.", "type2": "Poison"}, {"id": "95", "name": "Onix", "image": "p95", "type1": "Rock", "height": "8.8 m", "weight": "210 kg", "desc": "Onix has a magnet in its brain. It acts as a compass so that this Pokémon does not lose direction while it is tunneling. As it grows older, its body becomes increasingly rounder and smoother.", "type2": "Ground"}, {"id": "96", "name": "Drowzee", "image": "p96", "type1": "Psychic", "height": "1 m", "weight": "32.4 kg", "desc": "It puts its prey to sleep and devours their dreams. It seems that bad dreams taste sour, so Drowzee doesn’t particularly like eating them."}, {"id": "97", "name": "Hypno", "image": "p97", "type1": "Psychic", "height": "1.6 m", "weight": "75.6 kg", "desc": "There are some Hypno that assist doctors with patients who can’t sleep at night in hospitals."}, {"id": "98", "name": "Krabby", "image": "p98", "type1": "Water", "height": "0.4 m", "weight": "6.5 kg", "desc": "Krabby live on beaches, burrowed inside holes dug into the sand. On sandy beaches with little in the way of food, these Pokémon can be seen squabbling with each other over territory."}, {"id": "99", "name": "Kingler", "image": "p99", "type1": "Water", "height": "1.3 m", "weight": "60 kg", "desc": "Kingler has an enormous, oversized claw. It waves this huge claw in the air to communicate with others. However, because the claw is so heavy, the Pokémon quickly tires."}, {"id": "100", "name": "Voltorb", "image": "p100", "type1": "Electric", "height": "0.5 m", "weight": "10.4 kg", "desc": "Voltorb is extremely sensitive—it explodes at the slightest of shocks. It is rumored that it was first created when a Poké Ball was exposed to a powerful pulse of energy."}, {"id": "101", "name": "Electrode", "image": "p101", "type1": "Electric", "height": "1.2 m", "weight": "66.6 kg", "desc": "One of Electrode’s characteristics is its attraction to electricity. It is a problematical Pokémon that congregates mostly at electrical power plants to feed on electricity that has just been generated."}, {"id": "102", "name": "Exeggcute", "image": "p102", "type1": "Grass", "height": "0.4 m", "weight": "2.5 kg", "desc": "Although they are the same size as other Exeggcute, the ones produced in Alola are quite heavy. Their shells are packed full.", "type2": "Psychic"}, {"id": "103", "name": "Exeggutor", "image": "p103", "type1": "Grass", "height": "2 m", "weight": "120 kg", "desc": "Each of its three heads has its own thoughts. When they want to go in different directions, Exeggutor becomes unable to move.", "type2": "Psychic"}, {"id": "104", "name": "Cubone", "image": "p104", "type1": "Ground", "height": "0.4 m", "weight": "6.5 kg", "desc": "It wears its mother’s skull on its head, so no one knows what its bare face looks like. However, it’s clear that it’s always crying."}, {"id": "105", "name": "Marowak", "image": "p105", "type1": "Ground", "height": "1 m", "weight": "45 kg", "desc": "They thump their bones rhythmically to communicate among themselves. There are nearly 50 different rhythmic patterns."}, {"id": "106", "name": "Hitmonlee", "image": "p106", "type1": "Fighting", "height": "1.5 m", "weight": "49.8 kg", "desc": "Hitmonlee’s legs freely contract and stretch. Using these springlike legs, it bowls over foes with devastating kicks. After battle, it rubs down its legs and loosens the muscles to overcome fatigue."}, {"id": "107", "name": "Hitmonchan", "image": "p107", "type1": "Fighting", "height": "1.4 m", "weight": "50.2 kg", "desc": "Hitmonchan is said to possess the spirit of a boxer who had been working toward a world championship. This Pokémon has an indomitable spirit and will never give up in the face of adversity."}, {"id": "108", "name": "Lickitung", "image": "p108", "type1": "Normal", "height": "1.2 m", "weight": "65.5 kg", "desc": "It licks filth clean with its tongue. Whatever it licks always stinks afterward, so whether it’s really clean is...questionable."}, {"id": "109", "name": "Koffing", "image": "p109", "type1": "Poison", "height": "0.6 m", "weight": "1 kg", "desc": "Koffing embodies toxic substances. It mixes the toxins with raw garbage to set off a chemical reaction that results in a terribly powerful poison gas. The higher the temperature, the more gas is concocted by this Pokémon."}, {"id": "110", "name": "Weezing", "image": "p110", "type1": "Poison", "height": "1.2 m", "weight": "9.5 kg", "desc": "Weezing alternately shrinks and inflates its twin bodies to mix together toxic gases inside. The more the gases are mixed, the more powerful the toxins become. The Pokémon also becomes more putrid."}, {"id": "111", "name": "Rhyhorn", "image": "p111", "type1": "Ground", "height": "1 m", "weight": "115 kg", "desc": "Rhyhorn’s brain is very small. It is so dense, while on a run it forgets why it started running in the first place. It apparently remembers sometimes if it demolishes something.", "type2": "Rock"}, {"id": "112", "name": "Rhydon", "image": "p112", "type1": "Ground", "height": "1.9 m", "weight": "120 kg", "desc": "Rhydon has a horn that serves as a drill. It is used for destroying rocks and boulders. This Pokémon occasionally rams into streams of magma, but the armor-like hide prevents it from feeling the heat.", "type2": "Rock"}, {"id": "113", "name": "Chansey", "image": "p113", "type1": "Normal", "height": "1.1 m", "weight": "34.6 kg", "desc": "Because the eggs on their bellies have been overharvested by people in the past, the Chansey population remains very small."}, {"id": "114", "name": "Tangela", "image": "p114", "type1": "Grass", "height": "1 m", "weight": "35 kg", "desc": "Tangela’s vines snap off easily if they are grabbed. This happens without pain, allowing it to make a quick getaway. The lost vines are replaced by newly grown vines the very next day."}, {"id": "115", "name": "Kangaskhan", "image": "p115", "type1": "Normal", "height": "2.2 m", "weight": "80 kg", "desc": "You shouldn’t get close to the child when it’s playing outside its mother’s pouch. Its mother is always nearby watching over it."}, {"id": "116", "name": "Horsea", "image": "p116", "type1": "Water", "height": "0.4 m", "weight": "8 kg", "desc": "If Horsea senses danger, it will reflexively spray a dense black ink from its mouth and try to escape. This Pokémon swims by cleverly flapping the fin on its back."}, {"id": "117", "name": "Seadra", "image": "p117", "type1": "Water", "height": "1.2 m", "weight": "25 kg", "desc": "Seadra generates whirlpools by spinning its body. The whirlpools are strong enough to swallow even fishing boats. This Pokémon weakens prey with these currents, then swallows it whole."}, {"id": "118", "name": "Goldeen", "image": "p118", "type1": "Water", "height": "0.6 m", "weight": "15 kg", "desc": "The way it swims along fluttering its dress-like fins has earned it the name “princess of the water.”"}, {"id": "119", "name": "Seaking", "image": "p119", "type1": "Water", "height": "1.3 m", "weight": "39 kg", "desc": "To attract females, males dance on the river’s floor. The females gather around the male that dances most gracefully."}, {"id": "120", "name": "Staryu", "image": "p120", "type1": "Water", "height": "0.8 m", "weight": "34.5 kg", "desc": "No number of injuries can bother Staryu. Its amazing regenerative powers return it to its previous state in half a day!"}, {"id": "121", "name": "Starmie", "image": "p121", "type1": "Water", "height": "1.1 m", "weight": "80 kg", "desc": "It rotates its geometrically shaped body to swim through the water. It always seems to be sending out mysterious radio waves.", "type2": "Psychic"}, {"id": "122", "name": "Mr. Mime", "image": "p122", "type1": "Psychic", "height": "1.3 m", "weight": "54.5 kg", "desc": "It creates invisible walls with its pantomiming. If you don’t act impressed, it will attack you with a double slap!", "type2": "Fairy"}, {"id": "123", "name": "Scyther", "image": "p123", "type1": "Bug", "height": "1.5 m", "weight": "56 kg", "desc": "Some call it a ninja. Its movements— imperceptibly quick—are sufficient to cleave the air in two. It’s very popular in Alola.", "type2": "Flying"}, {"id": "124", "name": "Jynx", "image": "p124", "type1": "Ice", "height": "1.4 m", "weight": "40.6 kg", "desc": "Its strange cries sound like human language. There are some musicians who compose songs for Jynx to sing.", "type2": "Psychic"}, {"id": "125", "name": "Electabuzz", "image": "p125", "type1": "Electric", "height": "1.1 m", "weight": "30 kg", "desc": "While it’s often blamed for power outages, the truth is the cause of outages is more often an error on the part of the electric company."}, {"id": "126", "name": "Magmar", "image": "p126", "type1": "Fire", "height": "1.3 m", "weight": "44.5 kg", "desc": "The hotter the place, the better they feel. Magmar in Alola are said to be hardier than those in other areas."}, {"id": "127", "name": "Pinsir", "image": "p127", "type1": "Bug", "height": "1.5 m", "weight": "55 kg", "desc": "Although it’s tough, it can’t handle cold well. When night falls, it buries itself in leafage and sleeps."}, {"id": "128", "name": "Tauros", "image": "p128", "type1": "Normal", "height": "1.4 m", "weight": "88.4 kg", "desc": "The climate seems to be related to the reason Tauros in Alola are a little calmer than those in other regions."}, {"id": "129", "name": "Magikarp", "image": "p129", "type1": "Water", "height": "0.9 m", "weight": "10 kg", "desc": "Thanks to their strong hold on life, dirty water doesn’t bother them at all. They live in waters all over the world!"}, {"id": "130", "name": "Gyarados", "image": "p130", "type1": "Water", "height": "6.5 m", "weight": "235 kg", "desc": "The energy from evolution stimulated its brain cells strongly, causing it to become very ferocious.", "type2": "Flying"}, {"id": "131", "name": "Lapras", "image": "p131", "type1": "Water", "height": "2.5 m", "weight": "220 kg", "desc": "They’ve been so cherished that there’s now an overabundance. The fish Pokémon population has declined in waters with too many Lapras.", "type2": "Ice"}, {"id": "132", "name": "Ditto", "image": "p132", "type1": "Normal", "height": "0.3 m", "weight": "4 kg", "desc": "It transforms into whatever it sees. If the thing it’s transforming into isn’t right in front of it, Ditto relies on its memory—so sometimes it fails."}, {"id": "133", "name": "Eevee", "image": "p133", "type1": "Normal", "height": "0.3 m", "weight": "6.5 kg", "desc": "Its genes are easily influenced by its surroundings. Even its face starts to look like that of its Trainer."}, {"id": "134", "name": "Vaporeon", "image": "p134", "type1": "Water", "height": "1 m", "weight": "29 kg", "desc": "It detects nearby moisture with its fin. When its fin begins trembling rapidly, that means rain will fall in a few hours."}, {"id": "135", "name": "Jolteon", "image": "p135", "type1": "Electric", "height": "0.8 m", "weight": "24.5 kg", "desc": "Its fur stands on end, becoming like needles it fires at enemies. Once they’re weakened, it finishes them off with a 10,000 volt shock."}, {"id": "136", "name": "Flareon", "image": "p136", "type1": "Fire", "height": "0.9 m", "weight": "25 kg", "desc": "The flame chamber inside its body ignites when Flareon gets agitated, reaching temperatures of up to 1,650 degrees Fahrenheit."}, {"id": "137", "name": "Porygon", "image": "p137", "type1": "Normal", "height": "0.8 m", "weight": "36.5 kg", "desc": "It was built 20 years ago by scientists who dreamed of exploring space. Their dreams have yet to come true."}, {"id": "138", "name": "Omanyte", "image": "p138", "type1": "Rock", "height": "0.4 m", "weight": "7.5 kg", "desc": "It was restored from an ancient fossil. Those Helix Fossils are excavated from areas that were once oceans long, long ago.", "type2": "Water"}, {"id": "139", "name": "Omastar", "image": "p139", "type1": "Rock", "height": "1 m", "weight": "35 kg", "desc": "It wraps its prey in its tentacles to immobilize them and then finishes them off with its sharp fangs.", "type2": "Water"}, {"id": "140", "name": "Kabuto", "image": "p140", "type1": "Rock", "height": "0.5 m", "weight": "11.5 kg", "desc": "This Pokémon became extinct everywhere, except in a few areas. It protects itself with its hard shell.", "type2": "Water"}, {"id": "141", "name": "Kabutops", "image": "p141", "type1": "Rock", "height": "1.3 m", "weight": "40.5 kg", "desc": "It swims at speeds of roughly 29 knots, quickly closing in on its prey and slashing into them with its scythes to finish them off.", "type2": "Water"}, {"id": "142", "name": "Aerodactyl", "image": "p142", "type1": "Rock", "height": "1.8 m", "weight": "59 kg", "desc": "It flew through the open skies over the ancient continent as if they were its own. When it touched ground, its walk was weak and slow.", "type2": "Flying"}, {"id": "143", "name": "Snorlax", "image": "p143", "type1": "Normal", "height": "2.1 m", "weight": "460 kg", "desc": "It has no interest in anything other than eating. Even if you climb up on its stomach while it’s napping, it doesn’t seem to mind at all!"}, {"id": "144", "name": "Articuno", "image": "p144", "type1": "Ice", "height": "1.7 m", "weight": "55.4 kg", "desc": "Articuno is a legendary bird Pokémon that can control ice. The flapping of its wings chills the air. As a result, it is said that when this Pokémon flies, snow will fall.", "type2": "Flying"}, {"id": "145", "name": "Zapdos", "image": "p145", "type1": "Electric", "height": "1.6 m", "weight": "52.6 kg", "desc": "Zapdos is a legendary bird Pokémon that has the ability to control electricity. It usually lives in thunderclouds. The Pokémon gains power if it is stricken by lightning bolts.", "type2": "Flying"}, {"id": "146", "name": "Moltres", "image": "p146", "type1": "Fire", "height": "2 m", "weight": "60 kg", "desc": "Moltres is a legendary bird Pokémon that has the ability to control fire. If this Pokémon is injured, it is said to dip its body in the molten magma of a volcano to burn and heal itself.", "type2": "Flying"}, {"id": "147", "name": "Dratini", "image": "p147", "type1": "Dragon", "height": "1.8 m", "weight": "3.3 kg", "desc": "It sheds its skin—almost on a daily basis—and grows larger. Its skin is soft just after it’s been shed."}, {"id": "148", "name": "Dragonair", "image": "p148", "type1": "Dragon", "height": "4 m", "weight": "16.5 kg", "desc": "Some say that if you see it at the start of the year, flying through the sky and twisting its body, you’ll be healthy all year long."}, {"id": "149", "name": "Dragonite", "image": "p149", "type1": "Dragon", "height": "2.2 m", "weight": "210 kg", "desc": "You’ll often hear tales of this kindhearted Pokémon rescuing people or Pokémon that are drowning.", "type2": "Flying"}, {"id": "150", "name": "Mewtwo", "image": "p150", "type1": "Psychic", "height": "2 m", "weight": "122 kg", "desc": "Mewtwo is a Pokémon that was created by genetic manipulation. However, even though the scientific power of humans created this Pokémon’s body, they failed to endow Mewtwo with a compassionate heart."}, {"id": "151", "name": "Mew", "image": "p151", "type1": "Psychic", "height": "0.4 m", "weight": "4 kg", "desc": "Mew is said to possess the genetic composition of all Pokémon. It is capable of making itself invisible at will, so it entirely avoids notice even if it approaches people."}, {"id": "152", "name": "Chikorita", "image": "p152", "type1": "Grass", "height": "0.9 m", "weight": "6.4 kg", "desc": "In battle, Chikorita waves its leaf around to keep the foe at bay. However, a sweet fragrance also wafts from the leaf, becalming the battling Pokémon and creating a cozy, friendly atmosphere all around."}, {"id": "153", "name": "Bayleef", "image": "p153", "type1": "Grass", "height": "1.2 m", "weight": "15.8 kg", "desc": "Bayleef’s neck is ringed by curled-up leaves. Inside each tubular leaf is a small shoot of a tree. The fragrance of this shoot makes people peppy."}, {"id": "154", "name": "Meganium", "image": "p154", "type1": "Grass", "height": "1.8 m", "weight": "100.5 kg", "desc": "The fragrance of Meganium’s flower soothes and calms emotions. In battle, this Pokémon gives off more of its becalming scent to blunt the foe’s fighting spirit."}, {"id": "155", "name": "Cyndaquil", "image": "p155", "type1": "Fire", "height": "0.5 m", "weight": "7.9 kg", "desc": "Cyndaquil protects itself by flaring up the flames on its back. The flames are vigorous if the Pokémon is angry. However, if it is tired, the flames splutter fitfully with incomplete combustion."}, {"id": "156", "name": "Quilava", "image": "p156", "type1": "Fire", "height": "0.9 m", "weight": "19 kg", "desc": "Quilava keeps its foes at bay with the intensity of its flames and gusts of superheated air. This Pokémon applies its outstanding nimbleness to dodge attacks even while scorching the foe with flames."}, {"id": "157", "name": "Typhlosion", "image": "p157", "type1": "Fire", "height": "1.7 m", "weight": "79.5 kg", "desc": "Typhlosion obscures itself behind a shimmering heat haze that it creates using its intensely hot flames. This Pokémon creates blazing explosive blasts that burn everything to cinders."}, {"id": "158", "name": "Totodile", "image": "p158", "type1": "Water", "height": "0.6 m", "weight": "9.5 kg", "desc": "Despite the smallness of its body, Totodile’s jaws are very powerful. While the Pokémon may think it is just playfully nipping, its bite has enough power to cause serious injury."}, {"id": "159", "name": "Croconaw", "image": "p159", "type1": "Water", "height": "1.1 m", "weight": "25 kg", "desc": "Once Croconaw has clamped its jaws on its foe, it will absolutely not let go. Because the tips of its fangs are forked back like barbed fishhooks, they become impossible to remove when they have sunk in."}]